# This viminfo file was generated by Vim 7.4.
# You may edit it if you're careful!

# Value of 'encoding' when this file was written
*encoding=utf-8


# hlsearch on (H) or off (h):
~h
# Command Line History (newest to oldest):
:q!
:wq

# Search String History (newest to oldest):

# Expression History (newest to oldest):

# Input Line History (newest to oldest):

# Input Line History (newest to oldest):

# Registers:
"1	LINE	0
	
	the word is ${word}
"2	LINE	0
	echo "quel age"
	read age
	echo "quel nom"
	read name
	echo "Hello $name. Tu as $age"
"3	LINE	0
	#   -F TYPE Use firmware bug workaround. Type is one of: none, samsung
	#   -P TYPE Drive-specific presets: use, ignore, show, showall
	#    #      Comment: text after a hash sign is ignored
	#    \      Line continuation character
	# Attribute ID is a decimal integer 1 <= ID <= 255
	# except for -C and -U, where ID = 0 turns them off.
	# All but -d, -m and -M Directives are only implemented for ATA devices
	#
	# If the test string DEVICESCAN is the first uncommented text
	# then smartd will scan for devices /dev/hd[a-l] and /dev/sd[a-z]
"4	LINE	0
	
	
	
	# ignore temperature and power-on hours reports
	DEVICESCAN -I 194 -I 231 -I 9
	
	
"5	LINE	0
	# The file gives a list of devices to monitor using smartd, with one
	# device per line. Text after a hash (#) is ignored, and you may use
	# spaces and tabs for white space. You may use '\' to continue lines.
	
	# You can usually identify which hard disks are on your system by
	# looking in /proc/ide and in /proc/scsi.
	
	# The word DEVICESCAN will cause any remaining lines in this
	# configuration file to be ignored: it tells smartd to scan for all
	# ATA and SCSI devices.  DEVICESCAN may be followed by any of the
	# Directives listed below, which will be applied to all devices that
	# are found.  Most users should comment out DEVICESCAN and explicitly
	# list the devices that they wish to monitor.
	#DEVICESCAN
	
"6	LINE	0
	# Same as above for Windows. Option '-d 3ware,N' is not necessary,
	# disk (port) number is specified in device name.
	# NOTE: On Windows, DEVICESCAN works also for 3ware controllers.
	#/dev/hdc,0 -a -s L/../../2/01
	#/dev/hdc,1 -a -s L/../../2/03
	
	# Monitor 3 ATA disks directly connected to a HighPoint RocketRAID. Start long
	# self-tests Sundays between 1-2, 2-3, and 3-4 am. 
	#/dev/sdd -d hpt,1/1 -a -s L/../../7/01
	#/dev/sdd -d hpt,1/2 -a -s L/../../7/02
	#/dev/sdd -d hpt,1/3 -a -s L/../../7/03
	
	# Monitor 2 ATA disks connected to the same PMPort which connected to the
	# HighPoint RocketRAID. Start long self-tests Tuesdays between 1-2 and 3-4 am
	#/dev/sdd -d hpt,1/4/1 -a -s L/../../2/01
"7	LINE	0
	#/dev/sdc -d 3ware,3 -a -s L/../../7/04
	
	# Monitor 2 ATA disks connected to a 3ware 9000 controller which
	# uses the 3w-9xxx driver (Linux, FreeBSD). Start long self-tests Tuesdays
	# between 1-2 and 3-4 am.
	#/dev/twa0 -d 3ware,0 -a -s L/../../2/01
	#/dev/twa0 -d 3ware,1 -a -s L/../../2/03
	
	# Monitor 2 SATA (not SAS) disks connected to a 3ware 9000 controller which
	# uses the 3w-sas driver (Linux). Start long self-tests Tuesdays
	# between 1-2 and 3-4 am.
	# On FreeBSD /dev/tws0 should be used instead
	#/dev/twl0 -d 3ware,0 -a -s L/../../2/01
	#/dev/twl0 -d 3ware,1 -a -s L/../../2/03
	
"8	LINE	0
	# First two SCSI disks.  This will monitor everything that smartd can
	# monitor.  Start extended self-tests Wednesdays between 6-7pm and
	# Sundays between 1-2 am
	#/dev/sda -d scsi -s L/../../3/18
	#/dev/sdb -d scsi -s L/../../7/01
	
	# Monitor 4 ATA disks connected to a 3ware 6/7/8000 controller which uses
	# the 3w-xxxx driver. Start long self-tests Sundays between 1-2, 2-3, 3-4, 
	# and 4-5 am.
	# NOTE: starting with the Linux 2.6 kernel series, the /dev/sdX interface
	# is DEPRECATED.  Use the /dev/tweN character device interface instead.
	# For example /dev/twe0, /dev/twe1, and so on.
	#/dev/sdc -d 3ware,0 -a -s L/../../7/01
	#/dev/sdc -d 3ware,1 -a -s L/../../7/02
	#/dev/sdc -d 3ware,2 -a -s L/../../7/03
"9	LINE	0
	# Monitor all attributes except normalized Temperature (usually 194),
	# but track Temperature changes >= 4 Celsius, report Temperatures
	# >= 45 Celsius and changes in Raw value of Reallocated_Sector_Ct (5).
	# Send mail on SMART failures or when Temperature is >= 55 Celsius.
	#/dev/hdc -a -I 194 -W 4,45,55 -R 5 -m admin@example.com
	
	# An ATA disk may appear as a SCSI device to the OS. If a SCSI to
	# ATA Translation (SAT) layer is between the OS and the device then
	# this can be flagged with the '-d sat' option. This situation may
	# become common with SATA disks in SAS and FC environments.
"-	CHAR	0
	#

# File marks:
'0  1  0  ~/notif.py
'1  101  54  ~/.config/i3/config
'2  5  1  /developement/aur/core/linux/PKGBUILD
'3  138  0  /var/log/Xorg.0.log
'4  2  35  /developement/aur/intel-mkl/src/l_mkl_11.1.3.174/template.txt
'5  7  22  /developement/aur/intel-mkl/src/l_mkl_11.1.3.174/test
'6  1  18  /developement/aur/intel-mkl/src/l_mkl_11.1.3.174/template.txt
'7  2  1  /developement/aur/intel-mkl/src/l_mkl_11.1.3.174/input.in
'8  2  0  /developement/aur/intel-mkl/src/l_mkl_11.1.3.174/test
'9  96  47  ~/.config/i3/config

# Jumplist (newest first):
-'  1  0  ~/notif.py
-'  101  54  ~/.config/i3/config
-'  96  47  ~/.config/i3/config
-'  5  1  /developement/aur/core/linux/PKGBUILD
-'  1  0  /developement/aur/core/linux/PKGBUILD
-'  138  0  /var/log/Xorg.0.log
-'  1  0  /var/log/Xorg.0.log
-'  2  35  /developement/aur/intel-mkl/src/l_mkl_11.1.3.174/template.txt
-'  1  18  /developement/aur/intel-mkl/src/l_mkl_11.1.3.174/template.txt
-'  7  22  /developement/aur/intel-mkl/src/l_mkl_11.1.3.174/test
-'  2  0  /developement/aur/intel-mkl/src/l_mkl_11.1.3.174/test
-'  2  1  /developement/aur/intel-mkl/src/l_mkl_11.1.3.174/input.in
-'  1  0  /developement/aur/intel-mkl/src/l_mkl_11.1.3.174/input.in
-'  1  0  /developement/aur/intel-mkl/src/l_mkl_11.1.3.174/test
-'  1  0  ~/.config/i3/config
-'  4  69  /etc/polkit-1/rules.d/20-enable-mount.rules
-'  1  0  /etc/polkit-1/rules.d/20-enable-mount.rules
-'  1  0  ~/.config/environment
-'  16  0  /etc/smartd.conf
-'  1  0  /etc/smartd.conf
-'  1  0  /etc/ssh/banner
-'  1  29  /etc/issue
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  1  29  /etc/issue
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  7  0  /etc/smartd.conf
-'  1  0  /etc/ssh/banner
-'  1  29  /etc/issue
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  1  29  /etc/issue
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/banner
-'  1  29  /etc/issue
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  1  29  /etc/issue
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  16  0  /etc/smartd.conf
-'  1  0  /etc/smartd.conf
-'  1  0  /etc/ssh/banner
-'  1  29  /etc/issue
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  1  29  /etc/issue
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  7  0  /etc/smartd.conf
-'  1  0  /etc/ssh/banner
-'  1  29  /etc/issue
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  1  29  /etc/issue
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/banner
-'  1  29  /etc/issue
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  1  29  /etc/issue
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  1  0  ~/.config/environment
-'  16  0  /etc/smartd.conf
-'  1  0  /etc/smartd.conf
-'  1  0  /etc/ssh/banner
-'  1  29  /etc/issue
-'  111  0  /etc/ssh/sshd_config
-'  1  0  /etc/ssh/sshd_config
-'  111  0  /etc/ssh/sshd_config

# History of marks within files (newest to oldest):

> ~/notif.py
	"	1	0
	.	1	0
	+	1	0

> ~/.config/i3/config
	"	101	54
	^	101	55
	.	101	54
	+	96	47
	+	101	54

> /developement/aur/core/linux/PKGBUILD
	"	5	1
	^	5	2
	.	5	1
	+	6	22
	+	5	1

> /var/log/Xorg.0.log
	"	138	0

> /developement/aur/intel-mkl/src/l_mkl_11.1.3.174/template.txt
	"	2	35
	^	2	36
	.	2	35
	+	1	5
	+	1	18
	+	1	41
	+	2	35

> /developement/aur/intel-mkl/src/l_mkl_11.1.3.174/test
	"	7	22
	^	7	23
	.	7	22
	+	2	15
	+	2	7
	+	2	30
	+	3	29
	+	2	26
	+	7	22

> /developement/aur/intel-mkl/src/l_mkl_11.1.3.174/input.in
	"	2	1
	^	2	2
	.	2	1
	+	2	1

> /etc/polkit-1/rules.d/20-enable-mount.rules
	"	4	69
	^	4	70
	.	4	70
	+	4	70

> ~/.config/environment
	"	1	0

> /etc/smartd.conf
	"	16	0
	^	19	2
	.	21	1
	+	1	7
	+	1	39
	+	2	0
	+	4	23
	+	8	0
	+	8	2
	+	8	0
	+	8	0
	+	10	7
	+	11	7
	+	8	0
	+	8	0
	+	17	0
	+	21	0
	+	22	0
	+	23	0
	+	8	0
	+	8	0
	+	8	0
	+	8	0
	+	8	0
	+	6	0
	+	8	42
	+	9	17
	+	8	39
	+	10	61
	+	9	32
	+	49	0
	+	52	0
	+	51	0
	+	49	0
	+	21	1

> /etc/ssh/banner
	"	1	0

> /etc/issue
	"	1	29
	^	1	30
	.	1	29
	+	1	29

> /etc/ssh/sshd_config
	"	111	0
